


# 解题思路
# n个骰子，每个骰子6个面，总情况数为6^n6
# n
#  。
# 设F(n,s)F(n,s)为当骰子数为n，和为s的情况数量。
# 当n=1时，F(1,s)=1,其中s=1,2,3,4,5,6当n=1时，F(1,s)=1,其中s=1,2,3,4,5,6
# 当n\ge2时，F(n,s)=F(n-1,s-1)+F(n-1,s-2)+F(n-1,s-3)+F(n-1,s-4)+F(n-1,s-5)+F(n-1,s-6)当n≥2时，F(n,s)=F(n−1,s−1)+F(n−1,
# s−2)+F(n−1,s−3)+F(n−1,s−4)+F(n−1,s−5)+F(n−1,s−6)
# 或者更准确的：F(n,s)=\sum_{d=1}^{min(6,s-n+1)} F(n-1,s-d)F(n,s)=∑
# d=1
# min(6,s−n+1)
# ​
#  F(n−1,s−d)，为了使得s-d\ge n-1s−d≥n−1
#
# 时间复杂度：O(n^2)O(n
# 2
#  )
# 空间复杂度：O((n+1)(6n+1))=O(n^2)O((n+1)(6n+1))=O(n
# 2
#  )
# 由于n\le 11n≤11，时间是不算长的
# 由于6^{11}=3627970566
# 11
#  =362797056没有超出int范围，故可以放心用int
#
# 最后概率为P(n,s)=\frac{F(n,s)}{6^n}P(n,s)=
# 6
# n
#
# F(n,s)
#
